#ifndef __adc0808_H__
#define __adc0808_H__

sbit START 	= P3 ^ 0; 				//定义P3.0引脚位名称为START
sbit OE 	= P3 ^ 1; 					//定义P3.1引脚位名称为OE
sbit EOC 	= P3 ^ 2;					//定义P3.2引脚位名称为EOC
sbit CLK 	= P3 ^ 3;					//定义P3.3引脚位名称为CLK
sbit ADDA 	= P3 ^ 4;					//定义P3.4引脚位名称为ADDA
sbit ADDB 	= P3 ^ 5;					//定义P3.5引脚位名称为ADDB
sbit ADDC 	= P3 ^ 6;					//定义P3.6引脚位名称为ADDC

/*
uchar AD_Data;						//AD0809原始数据
uint Temp; 						  	//处理后的数据

		addselect(td);								//选择通道0-7
		if(num>50)									//程序每50次循环，通道+1
		{
			td++;
			if(td>7)								//0-7循环
				td=0;
			num=0;
		}
		else
		{
			num++;
		}
		AD_Data=adc0808read();						//读取adc0809的数据，返回int类型变量
		Temp = (AD_Data * 1.0 / 255 * 5) * 100; 	//数据处理：输出值=输入值*5/255  参数5是基准电压5V
*/
void addselect(int num)				//量程选择
{
	unsigned char CH;
    CH = num;						//通道号加
    ADDA = CH & 0x01;			//例如5通道计算方法：将通道对应的二进制0101&0001，结果就是0001，赋值给adda（引脚只能接受最低位的数据，只有1和0），那么adda引脚就是高电平
    ADDB = (CH & 0x02) >> 1;	//然后将通道5的二进制0101&0010，结果就是0000（因为所有位都不同），然后整组数据右移一位，赋值给addb，那么addb引脚就是低电平
    ADDC = (CH & 0x04) >> 2; 	//然后将通道5的二进制0101&0100，结果就是0100，然后整组数据右移两位，赋值给addc，那么addc引脚就是高电平，最后芯片的通道选择引脚的状态就是101，则选择的就是通道5了
}

unsigned int adc0808read()
{
	int AD_Data;
	OE = 0; 									//输出关闭
	START = 0;
	START = 1; 									//START由低到高跳变（上跳沿），寄存器清零
	START = 0;  								//START由高到低跳变（下跳沿），启动AD转换
	while(EOC == 0);							//等待转换结束
	OE = 1;		 								//输出允许
	AD_Data = P1;	  							//读ADC0809原始数据
	OE = 0;		  								//输出关闭	
	return AD_Data;
}
//*********************************************************************************
//函数名：TimeInitial
//函数功能：定时器初始化函数 T0方式2，自动重装初值：10，定时：10us，
//信号周期T：20us 信号频率f：f=1/T=1000000/20=50 000HZ=50KHZ
//*********************************************************************************
void TimeInitial()		 				//定时器初始化
{
    TMOD = 0x02;	 					//定时器工作模式
    TH0 = 246;			 				//定时器初值高8位
    TL0 = 246; 			     			//定时器初值低8位
    EA = 1;						   		//开总中断
    ET0 = 1;		 					//开定时器中断
    TR0 = 1;		 					//启动定时器
}


//*********************************************************************************
//函数名：Time0
//函数功能：定时器0中断服务子程序函数
//*********************************************************************************
void Time0(void) interrupt 1 using 0  	//定时器中断服务子程序
{
    CLK = ~CLK;	   						//产生AD0809工作脉冲：50KHZ
}
#endif